// 配列のサイズを大きめに取る
int N, T[101010], X[101010], Y[101010];
//---------------------------------------------------------------------------------------------------
#define yes "Yes"
#define no "No"
string solve()
{
  int pt = 0, px = 0, py = 0;
  rep(i, 0, N)
  {
    // この時点での座標から次の座標までの距離
    int d = abs(px - X[i]) + abs(py - Y[i]);
    // この時点での時刻から次の時刻までの距離
    int dt = T[i] - pt;
    // 次の座標までの距離と次の時刻までの距離が一致しているか
    if (dt < d)
      return no;
    // 次の座標までの距離と次の時刻までの距離の偶奇が一致しているか
    if ((dt - d) % 2 == 1)
      return no;

    pt = T[i];
    px = X[i];
    py = Y[i];
  }
  return yes;
}
//---------------------------------------------------------------------------------------------------
void _main()
{
  // 入力
  cin >> N;
  // Nの回数分だけ、t, x, yを入力
  rep(i, 0, N) cin >> T[i] >> X[i] >> Y[i];
  // 出力
  cout << solve() << endl;
}